Ran Plan for dir: `terraform/applications/qa/website` workspace: `default`

<details><summary>Show Output</summary>

```diff
21:39:58.669 STDOUT terraform: Initializing the backend...
21:39:58.865 STDOUT terraform: Successfully configured the backend "s3"! Terraform will automatically
21:39:58.865 STDOUT terraform: use this backend unless the backend configuration changes.
21:39:58.898 STDOUT terraform: Initializing modules...
21:39:58.899 STDOUT terraform: - website in ../../../modules/base-application
21:39:58.899 STDOUT terraform: Initializing provider plugins...
21:39:58.899 STDOUT terraform: - Finding hashicorp/aws versions matching "~> 6.14.0"...
21:39:59.059 STDOUT terraform: - Installing hashicorp/aws v6.14.1...
21:40:06.391 STDOUT terraform: - Installed hashicorp/aws v6.14.1 (signed by HashiCorp)
21:40:06.391 STDOUT terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
21:40:06.391 STDOUT terraform: selections it made above. Include this file in your version control repository
21:40:06.391 STDOUT terraform: so that Terraform can guarantee to make the same selections by default when
21:40:06.391 STDOUT terraform: you run "terraform init" in the future.
21:40:06.391 STDOUT terraform: Terraform has been successfully initialized!
21:40:11.700 STDOUT terraform: Terraform used the selected providers to generate the following execution
21:40:11.700 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
21:40:11.700 STDOUT terraform:   + create
21:40:11.700 STDOUT terraform: Terraform will perform the following actions:
21:40:11.700 STDOUT terraform:   # module.website.aws_s3_bucket.test-bucket will be created
21:40:11.700 STDOUT terraform:   + resource "aws_s3_bucket" "test-bucket" {
21:40:11.700 STDOUT terraform:       + acceleration_status         = (known after apply)
21:40:11.700 STDOUT terraform:       + acl                         = (known after apply)
21:40:11.700 STDOUT terraform:       + arn                         = (known after apply)
21:40:11.700 STDOUT terraform:       + bucket                      = "my-appplication-test-bucketcx-qqqqqqqqqqq-qa"
21:40:11.700 STDOUT terraform:       + bucket_domain_name          = (known after apply)
21:40:11.700 STDOUT terraform:       + bucket_prefix               = (known after apply)
21:40:11.700 STDOUT terraform:       + bucket_region               = (known after apply)
21:40:11.700 STDOUT terraform:       + bucket_regional_domain_name = (known after apply)
21:40:11.701 STDOUT terraform:       + force_destroy               = false
21:40:11.701 STDOUT terraform:       + hosted_zone_id              = (known after apply)
21:40:11.701 STDOUT terraform:       + id                          = (known after apply)
21:40:11.701 STDOUT terraform:       + object_lock_enabled         = (known after apply)
21:40:11.701 STDOUT terraform:       + policy                      = (known after apply)
21:40:11.701 STDOUT terraform:       + region                      = "us-east-1"
21:40:11.701 STDOUT terraform:       + request_payer               = (known after apply)
21:40:11.701 STDOUT terraform:       + tags_all                    = (known after apply)
21:40:11.701 STDOUT terraform:       + website_domain              = (known after apply)
21:40:11.701 STDOUT terraform:       + website_endpoint            = (known after apply)
21:40:11.701 STDOUT terraform:       + cors_rule (known after apply)
21:40:11.701 STDOUT terraform:       + grant (known after apply)
21:40:11.701 STDOUT terraform:       + lifecycle_rule (known after apply)
21:40:11.701 STDOUT terraform:       + logging (known after apply)
21:40:11.701 STDOUT terraform:       + object_lock_configuration (known after apply)
21:40:11.701 STDOUT terraform:       + replication_configuration (known after apply)
21:40:11.701 STDOUT terraform:       + server_side_encryption_configuration (known after apply)
21:40:11.701 STDOUT terraform:       + versioning (known after apply)
21:40:11.701 STDOUT terraform:       + website (known after apply)
21:40:11.701 STDOUT terraform:     }
21:40:11.701 STDOUT terraform: Plan: 1 to add, 0 to change, 0 to destroy.

21:40:16.175 STDOUT terraform: Terraform used the selected providers to generate the following execution
21:40:16.175 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
21:40:16.175 STDOUT terraform:   + create
21:40:16.175 STDOUT terraform: Terraform will perform the following actions:
21:40:16.175 STDOUT terraform:   # module.website.aws_s3_bucket.test-bucket will be created
21:40:16.175 STDOUT terraform:   + resource "aws_s3_bucket" "test-bucket" {
21:40:16.175 STDOUT terraform:       + acceleration_status         = (known after apply)
21:40:16.175 STDOUT terraform:       + acl                         = (known after apply)
21:40:16.175 STDOUT terraform:       + arn                         = (known after apply)
21:40:16.175 STDOUT terraform:       + bucket                      = "my-appplication-test-bucketcx-qqqqqqqqqqq-qa"
21:40:16.175 STDOUT terraform:       + bucket_domain_name          = (known after apply)
21:40:16.175 STDOUT terraform:       + bucket_prefix               = (known after apply)
21:40:16.175 STDOUT terraform:       + bucket_region               = (known after apply)
21:40:16.175 STDOUT terraform:       + bucket_regional_domain_name = (known after apply)
21:40:16.175 STDOUT terraform:       + force_destroy               = false
21:40:16.175 STDOUT terraform:       + hosted_zone_id              = (known after apply)
21:40:16.175 STDOUT terraform:       + id                          = (known after apply)
21:40:16.175 STDOUT terraform:       + object_lock_enabled         = (known after apply)
21:40:16.175 STDOUT terraform:       + policy                      = (known after apply)
21:40:16.175 STDOUT terraform:       + region                      = "us-east-1"
21:40:16.175 STDOUT terraform:       + request_payer               = (known after apply)
21:40:16.175 STDOUT terraform:       + tags_all                    = (known after apply)
21:40:16.175 STDOUT terraform:       + website_domain              = (known after apply)
21:40:16.175 STDOUT terraform:       + website_endpoint            = (known after apply)
21:40:16.175 STDOUT terraform:       + cors_rule (known after apply)
21:40:16.175 STDOUT terraform:       + grant (known after apply)
21:40:16.175 STDOUT terraform:       + lifecycle_rule (known after apply)
21:40:16.175 STDOUT terraform:       + logging (known after apply)
21:40:16.175 STDOUT terraform:       + object_lock_configuration (known after apply)
21:40:16.175 STDOUT terraform:       + replication_configuration (known after apply)
21:40:16.175 STDOUT terraform:       + server_side_encryption_configuration (known after apply)
21:40:16.175 STDOUT terraform:       + versioning (known after apply)
21:40:16.175 STDOUT terraform:       + website (known after apply)
21:40:16.175 STDOUT terraform:     }
21:40:16.175 STDOUT terraform: Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terraform/applications/qa/website
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.ricardoxyz.website/lock?id=ricardofukuda-org%252Fatlantis-terragrunt-terraform-integration-test%252Fterraform%252Fapplications%252Fqa%252Fwebsite%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terraform/applications/qa/website
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```